-- phpMyAdmin SQL Dump
-- version 4.0.9
-- http://www.phpmyadmin.net
--
-- ホスト: localhost
-- 生成日時: 2013 年 12 月 05 日 10:58
-- サーバのバージョン: 5.5.34-log
-- PHP のバージョン: 5.4.22

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8 */;

--
-- データベース: `twitter`
--

-- --------------------------------------------------------

--
-- テーブルの構造 `tweet`
--

CREATE TABLE IF NOT EXISTS `tweet` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `user_id` int(11) NOT NULL,
  `time` datetime NOT NULL,
  `text` varchar(280) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB  DEFAULT CHARSET=utf8 AUTO_INCREMENT=56 ;

--
-- テーブルのデータのダンプ `tweet`
--

INSERT INTO `tweet` (`id`, `user_id`, `time`, `text`) VALUES
(4, 48, '2013-11-29 20:03:52', '記念すべき初ツイート。'),
(5, 48, '2013-11-29 20:04:51', '今日は１日研究室で過ごしてた。もう少し人間らしい生活を送るべきなのかもしれない。'),
(6, 48, '2013-11-29 20:05:49', '来週は４男でスノボ！１年ぶりでちゃんと滑れるか分からんけど楽しみや！！'),
(7, 48, '2013-11-29 20:09:35', 'ふと思ったのだが、最近パソコンの前にいる時間が異様に長い気がする。LINEをパソコンに入れてからというもの、スマホが不要になって、電池が切れてても１日気づかないこともある。MacBook Airさいこー'),
(8, 48, '2013-11-29 20:14:31', 'Now I''m writing English sentences. Since making a trip to the U.S. I''ve learned English so much.'),
(9, 51, '2013-11-29 20:15:22', 'りあるわーるど初カキコだお！'),
(10, 51, '2013-11-29 20:16:33', 'ついったー始めたばっかりでなれてなぃから、ぃじめなぃで下さい(´・ω・)'),
(11, 51, '2013-11-29 20:17:40', '(´・ω・`)ｼｮﾎﾞﾝ　←　この顔文字のかわいさは異常'),
(12, 48, '2013-11-29 20:19:02', 'そういえば今頃アメリカはThanksGivingDayらしい。日本にはそういう文化がないから感覚がよく分からんが'),
(13, 48, '2013-11-29 21:02:47', '明日は土曜日！紅葉にツアーに申し込んだので、群馬行って、紅葉とかイルミネーションとか楽しんできます！'),
(14, 48, '2013-11-29 21:03:47', 'そういえばもうすぐ１２月か・・・。今年もあっという間だった気がする。大学４年間の中でも一番色々新しいことをやってみた年だったと思うので、悔いはないかな。'),
(15, 48, '2013-11-29 21:06:56', 'まだ１０ツイートもしてないのか。結構つぶやいたと思ってたんだけど・・・'),
(19, 48, '2013-11-29 21:25:47', '最近一人でカラオケ行って、年令のところに22才って書くと、こんな年になってヒトカラしていていいのかという気持ちになってくる。'),
(20, 48, '2013-11-29 21:26:14', '前に東京ドームまで歩いて日本シリーズ見に行った時にも思ったけど、すごい立地の所に住んでるんだなぁ。今の時期をもっと大切に過ごすべきなのかもしれない。'),
(21, 51, '2013-11-29 21:37:28', 'Ajaxで投稿機能作るの難しいお(´・ω・`)\nformvalidationとどうやって両立させるんだお(´・ω・`)'),
(22, 48, '2013-12-01 15:35:10', 'Ajax機能での初ツイートだよ〜。成功しろー！！'),
(26, 51, '2013-12-01 17:05:31', 'うまくいけ〜(´・ω・)'),
(27, 51, '2013-12-01 17:17:50', 'かなりうまくいってる気がする(`・ω・)'),
(28, 51, '2013-12-01 17:24:32', 'Twitterサービス作るだけどこんなに時間かかるとは思わなかったお。もっと精進が必要だお(´・ω・)'),
(29, 51, '2013-12-01 17:26:08', '昨日は車酔いのせいですごく疲れてしまったお(´-ω-)'),
(30, 51, '2013-12-01 17:26:46', 'いつの間にかもう12月だお、１年が終わるお(´・ω・)'),
(31, 51, '2013-12-01 17:28:09', '今度こそはうまく動いてほしのだけど・・・(´・ω・`)'),
(32, 51, '2013-12-01 17:29:01', 'やっと10ツイートを超えたお！(`・ω・)'),
(33, 48, '2013-12-01 18:24:20', 'もう後一歩ってところまで完成してきた気がする！あとは、フォームの再送信とかができないようにするだけかな。'),
(34, 48, '2013-12-01 18:26:21', '細々したバグがちょくちょく見つかるからどんどんつぶしていっているところです。なかなかすぐには完璧にならないもんだなぁ。'),
(35, 48, '2013-12-01 18:27:51', 'The more I fixed bugs in my code, the more I find new bugs...'),
(36, 48, '2013-12-01 18:28:36', '最近めっきり寒くなってきて、自転車乗ってるときも手袋なしじゃいられなくなってきた。'),
(37, 53, '2013-12-01 18:38:56', '初カキコ...ども...'),
(38, 48, '2013-12-01 23:22:00', 'もうバグはないと信じたい・・・。後はツイート時刻の表示じゃなくて、現在時刻からどれくらい前にツイートされたか、を表示するようにしないと。'),
(39, 48, '2013-12-01 23:42:30', '完成記念書き込み！'),
(40, 51, '2013-12-02 17:39:12', 'timestampがちゃんと獲得できているかチェックするお！(`・ω・)'),
(41, 51, '2013-12-02 23:11:25', 'よーし、完成だおーー三三三(`・ω・)'),
(42, 48, '2013-12-02 23:19:34', '本当に完成！長かった！気がする！'),
(43, 48, '2013-12-03 13:34:29', 'テスト用書き込み！'),
(44, 0, '2013-12-03 19:25:00', '攻撃じゃ〜(`・ω・)<script>alert("攻撃！");</script>'),
(45, 54, '2013-12-04 16:44:53', 'テスト用ツイート〜'),
(46, 54, '2013-12-04 16:57:52', '攻撃じゃー(＊`ω´)<script>alert("cross site scripting");</script>'),
(47, 54, '2013-12-04 16:58:41', 'なにっΣ(；・ω・)きかないだと'),
(48, 54, '2013-12-04 20:11:28', 'なんかうまくいってないぞ'),
(49, 48, '2013-12-04 20:39:54', 'CSRF対策が思ったよりも難しいな・・・。やっかいだ。'),
(50, 48, '2013-12-04 20:40:32', 'CSRF protectionをonにしているから、もしかしたらAjaxでの連投はできないかもしれない。とりあえずやってみよう。'),
(51, 48, '2013-12-04 21:06:32', 'ツイートできるのかなぁ'),
(52, 54, '2013-12-04 21:52:26', 'もう攻撃は効かないのか・・・(´・ω・)<script>alert("aaaa");</script>'),
(53, 51, '2013-12-04 21:56:09', 'XSSもCSRFも対策できたはずだお！！(`・ω・)'),
(54, 55, '2013-12-04 21:58:10', 'テスト用ツイートです。'),
(55, 48, '2013-12-04 21:59:25', 'CFRF対策した状態でちゃんと動いた！');

-- --------------------------------------------------------

--
-- テーブルの構造 `user`
--

CREATE TABLE IF NOT EXISTS `user` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `name` varchar(128) NOT NULL,
  `address` varchar(128) NOT NULL,
  `password` varchar(128) NOT NULL,
  `signup_time` datetime NOT NULL,
  `salt` varchar(128) NOT NULL,
  PRIMARY KEY (`id`),
  UNIQUE KEY `address` (`address`),
  UNIQUE KEY `address_2` (`address`),
  UNIQUE KEY `address_3` (`address`)
) ENGINE=InnoDB  DEFAULT CHARSET=utf8 AUTO_INCREMENT=56 ;

--
-- テーブルのデータのダンプ `user`
--

INSERT INTO `user` (`id`, `name`, `address`, `password`, `signup_time`, `salt`) VALUES
(48, 'テスト', 'test@gmail.com', '020b3d3bd92701561fb81677d0f0cbf77ab127205f7e23529dd6a873ae00c44d', '2013-11-28 19:37:38', 'f5cb2b9df9d184c4541a'),
(51, 'りあるわーるど', 'realworld@gmail.com', '4bca85825fde63c6daf81b820b4a86aa3223eec9d2b86f0204da8da7e1ac7d89', '2013-11-29 16:36:46', '4aacbe47bc26a9201261'),
(53, 'kaky', 'kaky0922@gmail.com', '8ec84ff86e6be3066c47891289e664396d673405ed042f8bbe7eb93f53b4718c', '2013-12-01 18:38:15', '2b7bd4c6a51381951729'),
(54, '<script>alert("cross site scripting")</script>', 'takayuki@gmail.com', 'd9ca178b7e1fbd43269d70eceddd8d1f3aa88e86adfb3fc2cc3548aed516ea34', '2013-12-03 15:37:06', '6d94fb4b2b0c40b3767e'),
(55, 'test2', 'test2@gmail.com', 'e51cef62e0c47bdd637f0da17de57196a86363eb8396360a301b347dfb14b247', '2013-12-04 21:57:58', 'fc81fc9e5596d213b6e8');

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
